dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxSrc_reg.h
/** \brief 8BC, Power Management System Service Request 3 */
#define SRC_PMS_PMS3_SR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00388BCu)
/** Alias (User Manual Name) for SRC_PMS_PMS3_SR.
* To use register names with standard convension, please use SRC_PMS_PMS3_SR.
*/
#define SRC_PMS3 (SRC_PMS_PMS3_SR)

/** \brief 8C0, Stand By Controller Service Request */
#define SRC_SCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00388C0u)

/** \brief 8D0, SMU Service Request 0 */
#define SRC_SMU_SMU0_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00388D0u)
/** Alias (User Manual Name) for SRC_SMU_SMU0_SR0.
* To use register names with standard convension, please use SRC_SMU_SMU0_SR0.
*/
#define SRC_SMU0 (SRC_SMU_SMU0_SR0)

/** \brief 8D4, SMU Service Request 1 */
#define SRC_SMU_SMU0_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00388D4u)
/** Alias (User Manual Name) for SRC_SMU_SMU0_SR1.
* To use register names with standard convension, please use SRC_SMU_SMU0_SR1.
*/
#define SRC_SMU1 (SRC_SMU_SMU0_SR1)

/** \brief 8D8, SMU Service Request 2 */
#define SRC_SMU_SMU0_SR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00388D8u)
/** Alias (User Manual Name) for SRC_SMU_SMU0_SR2.
* To use register names with standard convension, please use SRC_SMU_SMU0_SR2.
*/
#define SRC_SMU2 (SRC_SMU_SMU0_SR2)

/** \brief 900, HSPDM0 Buffer Service Request */
#define SRC_HSPDM_HSPDM0_BFR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038900u)
/** Alias (User Manual Name) for SRC_HSPDM_HSPDM0_BFR.
* To use register names with standard convension, please use SRC_HSPDM_HSPDM0_BFR.
*/
#define SRC_HSPDM0BFR (SRC_HSPDM_HSPDM0_BFR)

/** \brief 904, HSPDM0 RAMP Events  Service Request */
#define SRC_HSPDM_HSPDM0_RAMP /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038904u)
/** Alias (User Manual Name) for SRC_HSPDM_HSPDM0_RAMP.
* To use register names with standard convension, please use SRC_HSPDM_HSPDM0_RAMP.
*/
#define SRC_HSPDM0RAMP (SRC_HSPDM_HSPDM0_RAMP)

/** \brief 908, HSPDM0 Error / RAM Overflow Service Request */
#define SRC_HSPDM_HSPDM0_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038908u)
/** Alias (User Manual Name) for SRC_HSPDM_HSPDM0_ERR.
* To use register names with standard convension, please use SRC_HSPDM_HSPDM0_ERR.
*/
#define SRC_HSPDM0ERR (SRC_HSPDM_HSPDM0_ERR)

/** \brief 970, Radar Interface 0 Error Service Request */
#define SRC_RIF_RIF0_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038970u)
/** Alias (User Manual Name) for SRC_RIF_RIF0_ERR.
* To use register names with standard convension, please use SRC_RIF_RIF0_ERR.
*/
#define SRC_RIF0ERR (SRC_RIF_RIF0_ERR)

/** \brief 974, Radar Interface 0 Service Request */
#define SRC_RIF_RIF0_INT /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038974u)
/** Alias (User Manual Name) for SRC_RIF_RIF0_INT.
* To use register names with standard convension, please use SRC_RIF_RIF0_INT.
*/
#define SRC_RIF0INT (SRC_RIF_RIF0_INT)

/** \brief 978, Radar Interface 1 Error Service Request */
#define SRC_RIF_RIF1_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038978u)
/** Alias (User Manual Name) for SRC_RIF_RIF1_ERR.
* To use register names with standard convension, please use SRC_RIF_RIF1_ERR.
*/
#define SRC_RIF1ERR (SRC_RIF_RIF1_ERR)

/** \brief 97C, Radar Interface 1 Service Request */
#define SRC_RIF_RIF1_INT /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003897Cu)
/** Alias (User Manual Name) for SRC_RIF_RIF1_INT.
* To use register names with standard convension, please use SRC_RIF_RIF1_INT.
*/
#define SRC_RIF1INT (SRC_RIF_RIF1_INT)

/** \brief 980, SPU 0 Service Request */
#define SRC_SPU_SPU0_INT /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038980u)
/** Alias (User Manual Name) for SRC_SPU_SPU0_INT.
* To use register names with standard convension, please use SRC_SPU_SPU0_INT.
*/
#define SRC_SPU0INT (SRC_SPU_SPU0_INT)

/** \brief 984, SPU 0 Error Service Request */
#define SRC_SPU_SPU0_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038984u)
/** Alias (User Manual Name) for SRC_SPU_SPU0_ERR.
* To use register names with standard convension, please use SRC_SPU_SPU0_ERR.
*/
#define SRC_SPU0ERR (SRC_SPU_SPU0_ERR)

/** \brief 988, SPU 1 Service Request */
#define SRC_SPU_SPU1_INT /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038988u)
/** Alias (User Manual Name) for SRC_SPU_SPU1_INT.
* To use register names with standard convension, please use SRC_SPU_SPU1_INT.
*/
#define SRC_SPU1INT (SRC_SPU_SPU1_INT)

/** \brief 98C, SPU 1 Error Service Request */
#define SRC_SPU_SPU1_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003898Cu)
/** Alias (User Manual Name) for SRC_SPU_SPU1_ERR.
* To use register names with standard convension, please use SRC_SPU_SPU1_ERR.
*/
#define SRC_SPU1ERR (SRC_SPU_SPU1_ERR)

/** \brief 990, General Purpose Group 0 Service Request 0 */
#define SRC_GPSR_GPSR0_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038990u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR0_SR0.
* To use register names with standard convension, please use SRC_GPSR_GPSR0_SR0.
*/
#define SRC_GPSR00 (SRC_GPSR_GPSR0_SR0)

/** \brief 994, General Purpose Group 0 Service Request 1 */
#define SRC_GPSR_GPSR0_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038994u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR0_SR1.
* To use register names with standard convension, please use SRC_GPSR_GPSR0_SR1.
*/
#define SRC_GPSR01 (SRC_GPSR_GPSR0_SR1)

/** \brief 998, General Purpose Group 0 Service Request 2 */
#define SRC_GPSR_GPSR0_SR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038998u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR0_SR2.
* To use register names with standard convension, please use SRC_GPSR_GPSR0_SR2.
*/
#define SRC_GPSR02 (SRC_GPSR_GPSR0_SR2)

/** \brief 99C, General Purpose Group 0 Service Request 3 */
#define SRC_GPSR_GPSR0_SR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003899Cu)
/** Alias (User Manual Name) for SRC_GPSR_GPSR0_SR3.
* To use register names with standard convension, please use SRC_GPSR_GPSR0_SR3.
*/
#define SRC_GPSR03 (SRC_GPSR_GPSR0_SR3)

/** \brief 9A0, General Purpose Group 0 Service Request 4 */
#define SRC_GPSR_GPSR0_SR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389A0u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR0_SR4.
* To use register names with standard convension, please use SRC_GPSR_GPSR0_SR4.
*/
#define SRC_GPSR04 (SRC_GPSR_GPSR0_SR4)

/** \brief 9A4, General Purpose Group 0 Service Request 5 */
#define SRC_GPSR_GPSR0_SR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389A4u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR0_SR5.
* To use register names with standard convension, please use SRC_GPSR_GPSR0_SR5.
*/
#define SRC_GPSR05 (SRC_GPSR_GPSR0_SR5)

